```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.main["FASTLANE_SERVICE_ACCOUNT_KEY"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-07-27 19:33:46 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:FASTLANE_SERVICE_ACCOUNT_KEY" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:27:55 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["FIREBASE_ANDROID_APP_ID"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-08-12 18:39:54 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:FIREBASE_ANDROID_APP_ID" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:28:06 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["FIREBASE_GOOGLE_SERVICES"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-08-12 18:39:56 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:FIREBASE_GOOGLE_SERVICES" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:27:54 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["GH_APP_ID"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-09-01 20:36:35 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:GH_APP_ID" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:27:56 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["GH_PRIVATE_KEY"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-09-01 20:36:36 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:GH_PRIVATE_KEY" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:28:03 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["GOOGLE_SERVICE_ACCOUNT_ID"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-07-27 19:33:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:GOOGLE_SERVICE_ACCOUNT_ID" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:27:57 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["INTEGRATION_API_KEY"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-10-27 09:43:43 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:INTEGRATION_API_KEY" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:28:00 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["OP_SERVICE_ACCOUNT_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-05-21 14:55:31 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:OP_SERVICE_ACCOUNT_TOKEN" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:27:59 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["RELEASE_KEYSTORE_FILE"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-07-27 19:33:38 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:RELEASE_KEYSTORE_FILE" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:27:58 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["RELEASE_KEYSTORE_PROPERTIES"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-07-27 19:33:44 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:RELEASE_KEYSTORE_PROPERTIES" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:28:04 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.main["WORKLOAD_IDENTITY_PROVIDER"] must be replaced
-/+ resource "github_actions_secret" "main" {
      ~ created_at       = "2025-07-27 19:33:42 +0000 UTC" -> (known after apply)
      + destroy_on_drift = true # forces replacement
      ~ id               = "playground.ashdavies.dev:WORKLOAD_IDENTITY_PROVIDER" -> (known after apply)
      + plaintext_value  = (sensitive value) # forces replacement
      ~ updated_at       = "2025-11-01 12:28:02 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 11 to add, 0 to change, 11 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->